xfire-core/src/test/org/codehaus/xfire/service/binding/header.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns="urn:HeaderService">
 <env:Header>
  <in1>two</in1>
 </env:Header>
 <env:Body>
  <a>one</a>
  
  <b>three</b>
 </env:Body>
</env:Envelope>